<template>
<div class="policy">
	<p @click="dialogVisible = true" class="policy__link">Политика обработки персональных данных</p>

	<el-dialog
		title="Обработка данных"
		:visible.sync="dialogVisible"
		width="85%"
		:before-close="handleClose">

			<h2>1. Что регулирует настоящая политика конфиденциальности</h2>

			<p>
				Настоящая политика конфиденциальности (далее — Политика) действует в отношении всей информации, включая персональные данные в понимании применимого законодательства (далее — «Персональная информация»), которую ООО «Гросс маркет» и/или его аффилированные лица, в том числе входящие в одну группу с ООО «Гросс маркет» (далее — «Гросс маркет»), могут получить о Вас в процессе использования Вами любых сайтов, программ, продуктов и/или сервисов Гросс маркет (далее вместе  «Сервисы»), информацию о которых Гросс маркет может также получать Персональную информацию от своих партнеров (далее — «Партнеры»), сайты, программы, продукты или сервисы которых Вы используете (например, от рекламодателей Гросс маркет или службами такси). В таких случаях передача Персональной информации возможна только в случаях, установленных применимым законодательством, и осуществляется на основании специальных договоров между Гросс маркет и каждым из Партнеров.
			</p>
			<p style="color: #b3b3b3">
				Пожалуйста, обратите внимание, что использование любого из Сайтов и/или Сервисов может регулироваться дополнительными условиями, которые могут вносить в настоящую Политику изменения и/или дополнения, и/или иметь специальные условия в отношении персональной информации, размещенные в соответствующих разделах документов для таких Сайтов /или Сервисов.
			</p>

			<h2>2. Кто обрабатывает информацию</h2>

			<p>
				Для обеспечения использования Вами Сайтов и Сервисов Ваша Персональная информация собирается и используется Яндексом, в том числе включая общество с ограниченной ответственностью «Гросс маркет», юридическое лицо, созданное по законодательству Российской Федерации и зарегистрированное по адресу: 123351, Россия, Москва, ул. Гроссова, д. 12 (ООО «Гросс маркет»), или его аффилированным лицом, предоставляющим соответствующий Сервис в иных юрисдикциях. С информацией о том, какое лицо предоставляет тот или иной Сервис, Вы можете ознакомиться в условиях использования соответствующего Сервиса.
			</p>

			<h2>3. Какова цель данной Политики</h2>
			<p>
				Защита Вашей Персональной информации и Вашей конфиденциальности чрезвычайно важны для Гросс маркета. Поэтому при использовании Вами Сайтов и Сервисов Гросс маркет защищает и обрабатывает Вашу Персональную информацию в строгом соответствии с применимым законодательством.
			</p>

			<h2>4. Какую Персональную информацию о Вас собирает Гросс маркет</h2>
			<p>
				Для обеспечения использования Вами Сайтов и Сервисов Ваша Персональная информация собирается и используется Яндексом, в том числе включая общество с ограниченной ответственностью «Гросс маркет», юридическое лицо, созданное по законодательству Российской Федерации и зарегистрированное по адресу: 123351, Россия, Москва, ул. Гроссова, д. 12 (ООО «Гросс маркет»), или его аффилированным лицом, предоставляющим соответствующий Сервис в иных юрисдикциях. С информацией о том, какое лицо предоставляет тот или иной Сервис, Вы можете ознакомиться в условиях использования соответствующего Сервиса.
			</p>
	</el-dialog>
</div>

</template>

<script>
	export default {
		data () {
			return {
				dialogVisible: false
			}
		},
		methods: {
			handleClose () {
				this.dialogVisible = false
			}
		}
	}
</script>

<style lang="scss">
	.policy__link {
		cursor: pointer;
		&:hover {
			text-decoration: underline;
			text-decoration-color: #FFDF31;
		}
	}
	.el-dialog {
		-webkit-border-radius: 8px;
	        	  border-radius: 8px;
	}
	.el-dialog__title {
		font-size: 72px;
	}
	.el-dialog__headerbtn {
		.el-dialog__close {
			color: #000;
			font-size: 25px;
			&:hover {
				color: #FFDF31;
			}
		}
	}
	.el-dialog__header {
		padding: 80px 95px 0;
	}
	.el-dialog__body {
		word-break: unset;
		padding: 50px 95px 120px;
	}
	.policy {
		h2 {
			font-size: 18px;
			line-height: 23px;
			margin-bottom: 25px;
			margin-top: 50px;
			&:first-of-type {
				margin-top: 0;
			}
		}
		p {
			line-height: 22px;
			font-size: 14px;
			margin-bottom: 25px;
		}
	}
</style>